{"title":"The Could Have Beens","description":"A data-driven revisionist history of the NBA draft.","url":"https://pudding.cool/2022/02/redraft","intro1":"Five years ago we <a href=https://pudding.cool/2017/03/redraft/ target=_blank>redrafted the NBA</a> with data. We figured it was time to update with more recent drafts, and ask some new questions.","intro2A":"So let’s begin. Hmm...I’m guessing you are a fan of the","intro2B":"No shame in admitting it.","couldTitle":"Hindsight is 20/20, but it probably stings a bit to see what could have been for the","could1":"Where do these better players come from? The short version: each player gets a rating of 0–100 from a blend of four advanced stats based on their top five seasons. The upgrade pick is a player that was drafted lower but has a higher rating. Squads are made up of the biggest rating upgrades. See the <a href=#method>method section</a> for details.","teamsTitle":"Drafting is hard. Here is how often each team selects the best player available in the first round.","teamsDek":"Select a team below to see their player report card. A player’s grade is based on the size of the gap between their rating and the best player available.","teams1":"More recent players will have less extreme ratings since their best producing seasons are still ahead of them. Take Markelle Fultz who gets a “B”. Real life tells us he is probably going to be considered a bust. But he is being compared to the likes of Tatum, who will likely widen the rating gap more as he enters his prime, which will lower Fultz’s grade.","teams2":"<em>*Note: Players with an asterisk played their rookie year for a team that didn’t draft them, usually due to a draft-day trade.","histogramTitle":"The busts and steals of every modern NBA draft class through 2017","histogramDek":"The number of spots a player should have risen or dropped by year.","histogram1":"The 2010 draft class was perhaps the least exciting (or most accurate), with the most players of any class drafted close to their correct spot. It was also the only class the data suggests had no players that should have dropped 20+ spots.","method1":"Data from <a href=https://basketball-reference.com target=_blank>Basketball Reference</a>. The four advanced stats used to create a player’s rating were <a href=https://www.basketball-reference.com/about/glossary.html#:~:text=VORP target=_blank>VORP</a>, <a href=https://www.basketball-reference.com/about/glossary.html#:~:text=WS target=_blank>Win Shares</a>, <a href=https://fivethirtyeight.com/features/introducing-raptor-our-new-metric-for-the-modern-nba/ target=_blank>RAPTOR WAR</a>, and <a href=https://docs.google.com/spreadsheets/d/1EIZvj_3-9SZULWomHz54V1CPL092j70u_0vUhoEEaIk/edit#gid=0 target=_blank>Wins Added</a>. No all-in-one advanced stat is perfect, so I chose a blend that satisfied the eye test (see <a href=#method-table>table below</a>). Each stat was normalized then averaged together to create a master scale of a player’s rating from 0 to 100. Ratings were based on a player’s top five seasons to find the balance between prime and longevity (an average NBA career is 4.5 years).","method2":"Only showing draft classes through 2017 because they have at least five years of data. Upgrade choices in the Could Have Been teams were first selected from top 10 picks, then searched beyond those if there weren’t enough to fill the top five. Draft trades were ignored since swaps usually are contingent on player availability and often include multiple players or money.","method3":"Report card grades for draft picks were calculated as follows: a player’s potential was the difference between their rating (from above) and the best player available in that draft at their pick. If they were the best player available (i.e., a potential of 0), they got an A+. The remaining grades were evenly distributed, with a uniform number of players receiving each grade value.","appendixTitle":"Top 50 Players Since the 1989 Draft","appendixDek":"A player’s rating is a blend of four advanced stats based on their top five seasons, then scaled to the 🐐who is #1 in every stat. Stats below are scaled, not raw values."}